brew update
brew upgrade

brew 'qt5'
brew 'imagemagick'
brew 'node'
brew 'the_silver_searcher'
brew 'fzf'
brew 'nvm'
brew 'rbenv'
brew 'ruby-build'
brew 'redis', restart_service: true
brew 'postgres'
brew 'sqlite'
brew 'mysql'
brew 'mongodb'
brew 'pgcli'
brew 'imagemagick'
brew 'vim' --with-override-system-vim --with-lua --with-csope
brew 'macvim' --custom-icons --env-std --with-override-system-vim --with-lua --with-csope
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'tidy-html5'
# Facebook path picker (files list picker and command execution)
brew 'fpp'

install caskroom/cask/brew-cask

# Util
cask install 'alfred'
cask install 'amethyst'
cask install 'flux'
cask install 'the-unarchiver'

# Dev
cask install 'iterm2'
cask install 'atom'
cask install 'sequel-pro'
cask install 'kdiff3'

# Misc.
cask install '1password'
cask install 'crashplan'
cask install 'google-chrome'
cask install 'firefox'
cask install 'evernote'
cask install 'dropbox'
cask install 'spotify'
cask install 'slack'
cask install 'vlc'

cask alfred link

brew linkapps

brew cask cleanup
brew cleanup

